In [4]:
import pandas as pd

In [5]:
# 딕셔너리 생성
# 딕셔너리의 key 값은 데이터프레임의 열방향 인덱스(열이름)으로 설정
data = {
    '2015':[23456, 456786, 333343, 235544],
    '2010':[34765, 456786, 333343, 235544],
    '2005':[23456, 876546, 333343, 235544],
    '2000':[23456, 456786, 333343, 235544],
    '지역':['수도권', '경상권', '수도권', '경상권'],
    '2010~2015 증가율':[0.3456, 0.2345, 0.5432, 0.3452]
}

# 행방향 인덱스 (index)
index = ['서울', '부산', '인천', '대구']

# 데이터프레임 생성 : DataFrame(데이터, index, columns)
# DataFrame(데이터, index)
df = pd.DataFrame(data, index=index)
df

      2015    2010    2005    2000   지역  2010~2015 증가율
서울   23456   34765   23456   23456  수도권         0.3456
부산  456786  456786  876546  456786  경상권         0.2345
인천  333343  333343  333343  333343  수도권         0.5432
대구  235544  235544  235544  235544  경상권         0.3452

In [6]:
# 인덱스와 열에 이름 지정
df.index.name = '도시'
df

      2015    2010    2005    2000   지역  2010~2015 증가율
도시
서울   23456   34765   23456   23456  수도권         0.3456
부산  456786  456786  876546  456786  경상권         0.2345
인천  333343  333343  333343  333343  수도권         0.5432
대구  235544  235544  235544  235544  경상권         0.3452

In [7]:
df.columns.name = '특성'
df

특성    2015    2010    2005    2000   지역  2010~2015 증가율
도시
서울   23456   34765   23456   23456  수도권         0.3456
부산  456786  456786  876546  456786  경상권         0.2345
인천  333343  333343  333343  333343  수도권         0.5432
대구  235544  235544  235544  235544  경상권         0.3452

 인덱싱 : 데이터프레임에서 특정 접근해서 데이터를 추출
 열 인덱싱 / 행 인덱싱
 
 열 인덱싱
 - 데이터프레임은 딕셔너리와 비슷하기 때문에 데이터프레임을 인덱싱할 때도 다음과 하면 됨
- 열 이름을 키 값으로 생각하고 인덱싱
- 인덱스로 열 이름을 사용하면 시리즈 객체가 반환
- 열 이름ㅇ르 리스로(여러 개로) 사용해서 인덱싱하면 부분적인 데이터프레임이 반환

In [8]:
# 인덱스 값이 하나인 경우 : 열 선택
# 1개 열 선택 : 시리즈로 반환
df['지역']

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [17]:
type(df['지역'])

pandas.core.series.Series

In [12]:
# 주의!!
# 행이름을 사용할 경우 오류 
# df['서울'] # KeyError

In [13]:
df[['2010', '2005']]

특성    2010    2005
도시
서울   34765   23456
부산  456786  876546
인천  333343  333343
대구  235544  235544

In [15]:
df[['지역']]

특성   지역
도시
서울  수도권
부산  경상권
인천  수도권
대구  경상권

In [16]:
type(df[['지역']])

pandas.core.frame.DataFrame

행 인덱싱(행 추출) : 슬라이싱만 가능
df[start:end] : start에서 end-1까지의 행 추출 (연속된 행)
행 인덱스가 정수 또는 문자인 경우 다 가능

In [19]:
df

특성    2015    2010    2005    2000   지역  2010~2015 증가율
도시
서울   23456   34765   23456   23456  수도권         0.3456
부산  456786  456786  876546  456786  경상권         0.2345
인천  333343  333343  333343  333343  수도권         0.5432
대구  235544  235544  235544  235544  경상권         0.3452

In [20]:
# 인덱스 0행만 추출
# 1개 행이라도 슬라이싱을 해야 함
df[:1]   # 0부터 1-1행까지 슬라이싱 (0부터 0까지 : 0행 1개)

특성   2015   2010   2005   2000   지역  2010~2015 증가율
도시
서울  23456  34765  23456  23456  수도권         0.3456

In [21]:
# 부산 ~ 인천 행 추출
df[1:3]

특성    2015    2010    2005    2000   지역  2010~2015 증가율
도시
부산  456786  456786  876546  456786  경상권         0.2345
인천  333343  333343  333343  333343  수도권         0.5432

In [23]:
# 연속되지 않은 행 추출 : loc/iloc 인덱서 이용
# 숫자 인덱스로 지정할 경우 : iloc 인덱서 사용
df.iloc[[0, 2, 3], :] # 0, 2, 3행, 모든 열: iloc[행, 열]

특성    2015    2010    2005    2000   지역  2010~2015 증가율
도시
서울   23456   34765   23456   23456  수도권         0.3456
인천  333343  333343  333343  333343  수도권         0.5432
대구  235544  235544  235544  235544  경상권         0.3452

In [24]:
# 연속되지 않은 행 추출
# 문자 인덱스로 지정할 경우 : loc 인덱서 사용 (loc[행, 열])
df.loc[['서울', '대구'], :]

특성    2015    2010    2005    2000   지역  2010~2015 증가율
도시
서울   23456   34765   23456   23456  수도권         0.3456
대구  235544  235544  235544  235544  경상권         0.3452

개별 데이터 인덱싱 : 특정 셀의 값 추출
- ~행~열에 위치한 데이터 추출
- df[열][행] : 먼저 열을 선택해서 추출한 다음 행을 선택해서 추출

In [25]:
# 2015년도의 서울의 인구 수 출력
df['2015']['서울']

23456

In [26]:
type(df['2015']['서울'])  # 단일 값 (스칼라)

numpy.int64

단일 값 : 스칼라
1차원 배열 형태 : 시리즈
2차원 테이블 형태 : 데이터프레임

전치 : 데이터프레임의 행과 열의 위치 바꾸기

In [27]:
df

특성    2015    2010    2005    2000   지역  2010~2015 증가율
도시
서울   23456   34765   23456   23456  수도권         0.3456
부산  456786  456786  876546  456786  경상권         0.2345
인천  333343  333343  333343  333343  수도권         0.5432
대구  235544  235544  235544  235544  경상권         0.3452

In [28]:
df.T

도시                 서울      부산      인천      대구
특성
2015            23456  456786  333343  235544
2010            34765  456786  333343  235544
2005            23456  876546  333343  235544
2000            23456  456786  333343  235544
지역                수도권     경상권     수도권     경상권
2010~2015 증가율  0.3456  0.2345  0.5432  0.3452

연습문제

데이터프레임 생성 : df_score

        국어 영어 수학
춘향
몽룡
향단
방자

(1) 모든 학생의 수학 점수를 시리즈로 나타낸다
(2) 모든 학생의 국어와 영어 점수를 데이터프레임으로 나타낸다
(3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다
(4) 방자의 영어 점수를 80점으로 수정하고, 평균 점수도 다시 계산한다
(5) 향단의 점수를 데이터프레임으로 나타낸다
(6) 향단의 점수를 시리즈로 나타낸다

In [29]:
# 데이터프레임 생성
data = {
    '국어': [80, 88, 90, 70],
    '영어': [90, 80, 77, 70],
    '수학': [80, 98, 90, 80]
}

index = ['춘향', '몽룡', '향단', '방자']
df_score = pd.DataFrame(data, index=index)
df_score

    국어  영어  수학
춘향  80  90  80
몽룡  88  80  98
향단  90  77  90
방자  70  70  80

In [30]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다
df_score['수학']

춘향    80
몽룡    98
향단    90
방자    80
Name: 수학, dtype: int64

In [31]:
# (2) 모든 학생의 국어와 영어 점수를 데이터프레임으로 나타낸다
df_score[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  88  80
향단  90  77
방자  70  70

In [32]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다
df_score['평균'] = round((df_score['국어'] + df_score['영어'] + df_score['수학']) / 3, 2)
df_score

    국어  영어  수학     평균
춘향  80  90  80  83.33
몽룡  88  80  98  88.67
향단  90  77  90  85.67
방자  70  70  80  73.33

In [33]:
# (4) 방자의 영어 점수를 80점으로 수정하고, 평균 점수도 다시 계산한다
df_score['영어']['방자'] = 80
df_score['평균'] = round((df_score['국어'] + df_score['영어'] + df_score['수학']) / 3, 2)
df_score

<ipython-input-33-c44ae2bcbc4c>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_score['영어']['방자'] = 80

    국어  영어  수학     평균
춘향  80  90  80  83.33
몽룡  88  80  98  88.67
향단  90  77  90  85.67
방자  70  80  80  76.67

In [35]:
# (5) 향단의 점수를 데이터프레임으로 나타낸다
df_score['향단' : '향단']

    국어  영어  수학     평균
향단  90  77  90  85.67

In [38]:
# (6) 향단의 점수를 시리즈로 나타낸다
# 시리즈로 값을 가져오기 위해서는 열의 값을 가져와야 함
# '향단' 인덱스이므로 시리즈로 가져올 수 없으므로
# 열로 바꿔줘야 함  -> 전치 (행인덱스 -> 열인덱스)
df_score.T

       춘향     몽룡     향단     방자
국어  80.00  88.00  90.00  70.00
영어  90.00  80.00  77.00  80.00
수학  80.00  98.00  90.00  80.00
평균  83.33  88.67  85.67  76.67

In [40]:
df_score.T['향단']

국어    90.00
영어    77.00
수학    90.00
평균    85.67
Name: 향단, dtype: float64

데이터프레임 고급 인덱싱
특별한 인덱서
- loc : 라벨값 기반의 2차원 인덱싱 (이름이 문자인 경우)
- iloc : 순서를 나타내는 정수 기반의 2차원 인덱싱
- at : 라벨값 기반의 2차원 인덱싱 (한 개의 스칼라 값만 찾음)
- ia : 순서를 나타내는 정수 기반의 2차원 인덱싱 (한 개의 스칼라 값만 찾음)
- at, ia는 빠른 인덱싱 속도가 요구되는 경우에 사용

loc 인덱서 (문자 기반)
(1) df.loc[행 인덱싱 값] : 값을 하나만 넣으면 행 선택
(2) df.loc[행 인덱싱 값, 열 인덱싱 값] : [행, 열] 방식 선택

In [41]:
import numpy as np

In [43]:
# 데이터프레임 생성
# 10~21 (12개)
# 3행 4열

df2 = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                  index = ['a', 'b', 'c'],
                  columns = ['A', 'B', 'C', 'D'])
df2

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [44]:
# a 행 추출
df2.loc['a']   # 시리즈 반환

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [45]:
# 연속된 여러 개의 행 추출
df2.loc['a':'c']

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [47]:
df2['a':'c']  # df2.loc['a':'c']와 동일

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [46]:
# 연속되지 않은 여러 개의 행 추출
df2.loc[['a', 'c']]

    A   B   C   D
a  10  11  12  13
c  18  19  20  21

In [53]:
# 인덱싱 값으로 불리언 시리즈 사용 가능
df2.loc[df2.A > 15]

    A   B   C   D
c  18  19  20  21

In [55]:
df2.A > 15

a    False
b    False
c     True
Name: A, dtype: bool

In [54]:
# 열 이름이 영문자인 경우 속성처럼 사용 가능
df2.C

a    12
b    16
c    20
Name: C, dtype: int32

In [57]:
# 정수 인덱스로 되어 있는 데이터프레임 생성
df3 = pd.DataFrame(np.arange(10, 26).reshape(4, 4),
                  columns = ['A', 'B', 'C', 'D'])
df3

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [58]:
# loc 인덱스에서 정수 인덱싱 할 때
# 문자 인덱스인 경우와 동일
df3.loc[0:2]

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21

In [ ]:
# 인덱싱 값을 행과 열 모두 받는 경우
# df.loc[행 인덱스, 열 인덱스]

In [59]:
df2

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [60]:
df2.loc['a', 'A']  # 특정 셀의 값 추출 : 단일 값

10

In [63]:
df2.loc['a':, 'D']

a    13
b    17
c    21
Name: D, dtype: int32

In [65]:
df2.loc['a', :]  #a행의 모든 열의 값

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [66]:
# 행 : a ~ c
# 열 : B ~ D
df2.loc['a':'c', 'B':'D']

    B   C   D
a  11  12  13
b  15  16  17
c  19  20  21

In [68]:
#  비연속 행, 열 추출
#  행 : a, c
#  열 : A, C, 
df2.loc[['a', 'c'], ['A', 'C', 'D']]

    A   C   D
a  10  12  13
c  18  20  21

In [67]:
df2

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [ ]:
# iloc : 순서를 나타내는 정수 인덱스만 받음
#- 문자, 숫자 인덱스로 된 데이터프레임에서 사용 가능

In [69]:
# 슬라이싱
df2.iloc[0:2]  # start ~ end-1

    A   B   C   D
a  10  11  12  13
b  14  15  16  17

In [70]:
# 인덱스 하나만 있으면 1개 행 추출 
df2.iloc[1]  # b 행

A    14
B    15
C    16
D    17
Name: b, dtype: int32

In [71]:
# 개별 데이터 인덱싱
df2.iloc[0, 1]   # 0행 1열의 값

11

In [74]:
df2.iloc[-1]   # 마지막 행 추출

A    18
B    19
C    20
D    21
Name: c, dtype: int32

In [75]:
# 행 : 2
# 열 : 1~2열
df2.iloc[2:3, 1:3]  # 데이터프레임으로 반환

    B   C
c  19  20

In [72]:
df2

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21